---
kind: method
id: M:Autodesk.Revit.DB.ElementStructuralTypeFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralType)
source: html/770e1c08-c3c1-129c-b7e5-00ee8f750647.htm
---
# Autodesk.Revit.DB.ElementStructuralTypeFilter.#ctor Method

Constructs a new instance of a filter to match elements by structural type.

## Syntax (C#)
```csharp
public ElementStructuralTypeFilter(
	StructuralType structuralType
)
```

## Parameters
- **structuralType** (`Autodesk.Revit.DB.Structure.StructuralType`) - The structural type to match.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration